# EnergyAnalysisCurrentViewOnly Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisCurrentViewOnly Property
ParameterTypeId Class See Also
---
"Use Only Elements Visible In Current View"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisCurrentViewOnly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisCurrentViewOnly As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisCurrentViewOnly {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace